About            
  What is TED?
  Why TED?
  Best TED Talks
TEDx
  At UCB-CBA
  When?
  Where?
Speakers
Team
Partners
Apply

What is TEDx?
  TED is a non-profit organization, which aims to bring off different
  types of conferences in California, USA. At this powerful talks they
  bring together some of the most important thinkers and
  entrepreneurs in the world to share the most passionate ideas.
  TED began in 1984 as a conference where Technology,
  Entertainment and Design converged, and today covers almost all
  topics from science, art, politics, education, culture, business to
  global issues in more than 100 languages. All of this, in order to
  support new initiatives and proposals that can create a significant
  change in the world.

Why TEDx?
  Since 2009, TED has put into effect the TEDx program, where the X
  represents an &quot;independently organized event&quot; and allows people
  from all over the world to have a TED experience with the aim of
  spreading new ideas from their communities.
  This program allows the complete authorization of a free license,
  which grants the possibility of organizing a local event under the
  corresponding guidelines of 

TED.TEDxUCBCochabamba
  TEDxUCBCochabamba is the university version from TEDx
  made at the Catholic University of Bolivia &quot;San Pablo&quot; in
  Cochabamba. Our vision is to be a meeting point for numerous
  conversations and new ideas that can make a difference in our
  country and our world.
  We are a non-profit organization by volunteers. Our mission is to
  share ideas that can transform new things.

When and Where?
  ¡SAVE THE DATE!
  August 11, 2018 at 9:00am to 4:00pm. The event will take place at
  the Principal Auditorium from The Catholic University of Bolivia “San
  Pablo” Cochabamba – Tupuraya Campus.
  M. Marquez Street and Jorge Trigo Andia Park.

Speakers

Teamwork
  We are a group of students from different educational institutions
  and fields of study, who are passionate in to the field of ideas, social
  initiatives, technology, design, arts and sciences. In order to achieve
  an event as TEDx, we firmly believe that teamwork, respect,
  responsibility and communication are the fundamental basis for a
  great coordination and excellent work.

They made our event possible